
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);

        /*Квадраты при игре в крестики-нолики занумерованы,
        как показано на рисунке. Заданы номера трех квадратов: N1, N2, N3. Проверить, лежат ли квадраты:
        На одной диагонали
·       На одной вертикали
        На одной горизонтали */

        int N1 = in.nextInt();
        int N2 = in.nextInt();
        int N3 = in.nextInt();
        if (N1 == 5 || N2 == 5 || N3 == 5) {
            if (N1 < N2 && N1 < N3) {
                if (((N1 + 4 == N2) || (N1 + 4 == N3)) && ((N2 + 4 == N3) || (N3 + 4 == N2)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N1 + 2 == N2) || (N1 + 2 == N3)) && ((N2 + 2 == N3) || (N3 + 2 == N2)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N1 + 1 == N2) || (N1 + 1 == N3)) && ((N2 + 1 == N3) || (N3 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N1 + 3 == N2) || (N1 + 3 == N3)) && ((N2 + 3 == N3) || (N3 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N2 < N1 && N2 < N3) {
                if (((N2 + 4 == N1) || (N2 + 4 == N3)) && ((N1 + 4 == N3) || (N3 + 4 == N1)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N2 + 2 == N1) || (N2 + 2 == N3)) && ((N1 + 2 == N3) || (N3 + 2 == N1)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N2 + 1 == N1) || (N2 + 1 == N3)) && ((N1 + 1 == N3) || (N3 + 1 == N1)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N2 + 3 == N1) || (N2 + 3 == N3)) && ((N1 + 3 == N3) || (N3 + 3 == N1)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N3 < N1 && N3 < N2) {
                if (((N3 + 4 == N1) || (N3 + 4 == N2)) && ((N1 + 4 == N2) || (N2 + 4 == N1)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N3 + 2 == N1) || (N3 + 2 == N2)) && ((N1 + 2 == N2) || (N2 + 2 == N1)))
                    System.out.println("Квадраты находятся на одной диагонали");
                else if (((N3 + 1 == N1) || (N3 + 1 == N2)) && ((N2 + 1 == N1) || (N1 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N3 + 3 == N2) || (N3 + 3 == N1)) && ((N2 + 3 == N1) || (N1 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            }
        }
        if (N1 == 1 || N2 == 1 || N3 == 1) {
            if (N1 < N2 && N1 < N3) {
                if (((N1 + 1 == N2) || (N1 + 1 == N3)) && ((N2 + 1 == N3) || (N3 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N1 + 3 == N2) || (N1 + 3 == N3)) && ((N2 + 3 == N3) || (N3 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N2 < N1 && N2 < N3) {
                if (((N2 + 1 == N1) || (N2 + 1 == N3)) && ((N1 + 1 == N3) || (N3 + 1 == N1)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N2 + 3 == N1) || (N2 + 3 == N3)) && ((N1 + 3 == N3) || (N3 + 3 == N1)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N3 < N1 && N3 < N2) {
                if (((N3 + 1 == N1) || (N3 + 1 == N2)) && ((N2 + 1 == N1) || (N1 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N3 + 3 == N2) || (N3 + 3 == N1)) && ((N2 + 3 == N1) || (N1 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            }
        }
        if (N1 == 9 || N2 == 9 || N3 == 9) {
            if (N1 < N2 && N1 < N3) {
                if (((N1 + 1 == N2) || (N1 + 1 == N3)) && ((N2 + 1 == N3) || (N3 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N1 + 3 == N2) || (N1 + 3 == N3)) && ((N2 + 3 == N3) || (N3 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N2 < N1 && N2 < N3) {
                if (((N2 + 1 == N1) || (N2 + 1 == N3)) && ((N1 + 1 == N3) || (N3 + 1 == N1)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N2 + 3 == N1) || (N2 + 3 == N3)) && ((N1 + 3 == N3) || (N3 + 3 == N1)))
                    System.out.println("Квадраты находятся на одной вертикали");
            } else if (N3 < N1 && N3 < N2) {
                if (((N3 + 1 == N1) || (N3 + 1 == N2)) && ((N2 + 1 == N1) || (N1 + 1 == N2)))
                    System.out.println("Квадраты находятся на одной горизонтали");
                else if (((N3 + 3 == N2) || (N3 + 3 == N1)) && ((N2 + 3 == N1) || (N1 + 3 == N2)))
                    System.out.println("Квадраты находятся на одной вертикали");
            }
        }
    }
}
